import json

avtomat = {
    "alphabet": [0, 1],

    #допускающие состояния
    "allowing positions": ["q0"],

    #таблица переходов
    "table": {
        'q0': ['q1', 'q3'],
        'q1': ['q0', 'q2'],   #допускает цепочки состоящие из чётного
        'q2': ['q1', "q3"],   #кол-ва 0 и 1
        'q3': ['q2', 'q0'],}
}

with open('DKA.txt', 'w') as outfile:
    json.dump(avtomat, outfile)


avtomat = {
    "alphabet": [0, 1],

    #допускающие состояния
    "allowing positions": ["q18","q19","q20","q21","q23","q24","q25","q28","q29","q31","q32"],

    #таблица переходов
    "table": {
        'q0': ['q5', 'q1'],
        'q1': ['q9', 'q2'],   
        'q2': ['q12', "q3"],   
        'q3': ['q14', 'q4'],
        'q4': ['q4', 'q4'],
        'q5': ['q15', 'q6'],
        'q6': ['q26', 'q7'],
        'q7': ['q30', 'q8'],
        'q8': ['q32', 'q4'],
        'q9': ['q26', 'q10'],
        'q10': ['q30', 'q11'],
        'q11': ['q32', 'q4'],
        'q12': ['q30', 'q13'],
        'q13': ['q32', 'q4'],
        'q14': ['q32', 'q4'],
        'q15': ['q26', 'q16'],
        'q16': ['q22', 'q17'],      # допускает цепочки в которой в любой      
        'q17': ['q20', 'q18'],      # последовательности из 5 символов есть
        'q18': ['q19', 'q4'],       # минимум 2 нуля
        'q19': ['q25', 'q4'],
        'q20': ['q25', 'q21'],
        'q21': ['q29', 'q4'],
        'q22': ['q25', 'q23'],
        'q23': ['q29', 'q24'],
        'q24': ['q20', 'q4'],
        'q25': ['q32', 'q31'],
        'q26': ['q30', 'q27'],
        'q27': ['q29', 'q28'],
        'q28': ['q20', 'q18'],
        'q29': ['q25', 'q23'],
        'q30': ['q32', 'q31'],
        'q31': ['q29', 'q28'],
        'q32': ['q32', 'q31'],}
}

with open('DKA2.txt', 'w') as outfile:
    json.dump(avtomat, outfile)
